package asdf;

public class Source {

}
//I.  로그인
//id입력
//	1.관리자 로그인 :1)신규 학생 추가		신규등록시 로그인 아이디 부여
//			4)신규 교수 추가
//			3)학생 정보 삭제 - remove
//			6)교수 정보 삭제
//			8)모든 교수 정보 보기
//			7)모든 학생 정보 보기
//			5)교수 정보 찾기-hashmap >>Id
//			2)학생 정보 찾기-hashmap
//			
//	2.교수 로그인 : 로그인 한 교수 정보 출력
//			1)담당 과목 등록
//			2)담당 과목 학생 정보 보기
//			3)정보 수정
//
//	3.학생 로그인 : 로그인 한 학생 정보 출력
//			1)수강 과목 신청
//			2)정보 수정
//						학생 기본 정보는 파일 입력,
//						수강 과목 입력은 키보드 입력
//
//						
//
//-------------------------------
//학생 정보 입력은 파일 입력으로.
//
//ArrayList 사용
//
//HashMap 사용
//
//
//교수가 담당과목을 개설하면 학생으로 로그인 시 수강신청 목록이 뜸.
//
//수강신청하면 교수 로그인 시 해당 과목에 담당학생 추가.
//
//
//학생 정보를 가지고 있는 file과 교수정보를 가지고 있는 file을 구분하여 사용